csrrs x5,0x803,x0       803022f3        x5  = 90014000
lw x10,0(x5)            0002a503        x10 = 90000000
vid.v v0                5208a057        v0  = 7,6,5,4,3,2,1,0
vsll.vi v0,v0,2         96013057        v0  = 1c,18,14,10,0c,08,04,00
vadd.vx v0,v0,x10       02054057        v0  = 9000001c,90000018,...
vlw12.v v2,0(v0)        0000217b        v2  = 随机整数
vlw12.v v3,0x100(v0)    100021FB        v3  = 随机整数
vlw12.v v4,0x180(v0)    1800227B        v4  = 随机整数
vftta.vv v4,v3,v2,v4    0E31420B
endprg                  0000400b